<?php

return [
    /*
    |--------------------------------------------------------------------------
    | MikroTik Connection
    |--------------------------------------------------------------------------
    */
    'host' => env('MIKROTIK_HOST', '192.168.88.1'),
    'port' => env('MIKROTIK_PORT', 8728),
    'username' => env('MIKROTIK_USERNAME', 'admin'),
    'password' => env('MIKROTIK_PASSWORD', ''),
    'timeout' => env('MIKROTIK_TIMEOUT', 5),

    /*
    |--------------------------------------------------------------------------
    | Mock Mode (للتطوير)
    |--------------------------------------------------------------------------
    | true = محاكاة (لا يحتاج router)
    | false = اتصال حقيقي
    */
    'mock' => env('MIKROTIK_MOCK', true),

    /*
    |--------------------------------------------------------------------------
    | Hotspot Settings
    |--------------------------------------------------------------------------
    */
    'hotspot' => [
        'profile' => 'default',
        'server' => 'all',
    ],

    /*
    |--------------------------------------------------------------------------
    | CoA Settings
    |--------------------------------------------------------------------------
    */
     'coa_secret' => env('MIKROTIK_COA_SECRET', 'coa_secret_2026'),
     'coa_port' => env('MIKROTIK_COA_PORT', 3799),
];
